m=[[1,4,6,-4,-12,1,5,-31,0,-3,-1],[4,-10,2,-5,-1,3,-18]]
#4 Задание
s=0
#5 Задание
n=0
for i in range(len(m)):
    for j in range(len(m[i])):
        #4 Задание
        if (m[i][j]<0):
            s+=m[i][j]
        #5 Задание
        elif (m[i][j]>0):
            n+=1
print('4. Сумма отрицательных элементов списка:',s)
print('5. Кол-во положительных элементов',n)

